Revit 2024 API
FabricationPartRouteEnd Class
 Class to hold fabrication part routing start or end information.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class FabricationPartRouteEnd : IDisposable
Visual Basic
Public Class FabricationPartRouteEnd _
	Implements IDisposable
Visual C++
public ref class FabricationPartRouteEnd : IDisposable
Remarks
 To create a new instance, use CreateFromConnector(Connector) to specify a connector, or CreateFromCenterline(Element, XYZ) to specify the centerline of a straight element, for the fabrication routing end point.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd
See Also
FabricationPartRouteEnd Members
Autodesk.Revit.DB.Fabrication Namespace